{
    "start": {
        "subtitle": "Configure a back up Tangem card",
        "description": "This xApp will help you setup a 'backup account' (also known as a Regular Key account) with your XUMM Tangem Card. It sets a RegularKey (on ledger) to your primary account. After the setup procedure, if you cannot find your secret key anymore in the future, you can sign with your card.",
        "list_header": "To continue you need:",
        "list_item_1": "Account to configure (card or non-card based)",
        "list_item_2": "Tangem card that you will use as your backup card",
        "list_item_3": "Import both accounts (to back up and back up card) in XUMM before proceeding",
        "button": "I'm ready, continue",
        "try_again": "Try again",
        "error": "Error fetching environment data"
    },
    "wizard": {
        "step_1": {
            "header": "1. Account to configure",
            "body": "This step will let you select your primary XRPL account. This is the account a back up card will be configured on.",
            "button": "Select account"
        },
        "step_2": {
            "header": "2. Back up Tangem card",
            "body": "Sign with the the back up account (Tangem card).",
            "button": "Select back up card"
        },
        "step_3": {
            "header": "3. Sign and Submit",
            "body": "Sign & submit the AccountSet transaction",
            "button": "Finish"
        },
        "success": "Card configured as back up card",
        "info": {
            "title": "Info",
            "text": "To sign with your back up card, import your primary account as Read Only account (r-address only) and make sure your Tangem card is imported."
        },
        "error": {
            "title": "Oops",
            "reactNative": "This WebPage is not supported",
            "failed": "Failed to fetch",
            "closed": "WebSocket closed",
            "websocket": "Problem with the WebSocket connection",
            "403": "Access denied (403)",
            "404": "Server not found (404)",
            "hasRegularKey": "This account already has a RegularKey (back up account) set",
            "equalAccounts": "You selected the same XRPL account (card) as source and destination",
            "notTangem": "The account you selected does not belong to a Tangem card, please try again",
            "dissabledMasterkey": "Master Key is disabled on your Tangem card: you cannot use this wizard",

            "hasRegularKeyTitle": "Existing Regular Key",
            "changeRegularKey": "This account already has a Regular Key (back up account) set. If you continue the back up account will be replaced (overwritten)",
            "cancelAction": "× Cancel",
            "confirmChangeRegularKey": "✓ Continue: replace backup account",

            "invalidParams": "One or more fields are specified incorrectly, or one or more required fields are missing.",
            "lgrNotFound": "The ledger specified by the ledger_hash or ledger_index does not exist, or it does exist but the server does not have it.",
            "actNotFound": "The Address specified in the account field of the request does not correspond to an account in the ledger.",

            "temDISABLED": "Occurs if the DeletableAccounts amendment is not enabled.",
            "temDST_IS_SRC": "Occurs if the Destination matches the sender of the transaction (Account field).",
            "tecDST_TAG_NEEDED": "Occurs if the Destination account requires a destination tag, but the DestinationTag field was not provided.",
            "tecNO_DST": "Occurs if the Destination account is not a funded account in the ledger.",
            "tecNO_PERMISSION":	"Occurs if the Destination account requires deposit authorization and the sender is not preauthorized.",
            "tecTOO_SOON": "Occurs if the sender's Sequence number is too high. The transaction's Sequence number plus 256 must be less than the current Ledger Index.",
            "tecHAS_OBLIGATIONS": "Occurs if the account to be deleted is connected to objects that cannot be deleted in the ledger. (This includes objects created by other accounts, such as escrows.)",
            "tefTOO_BIG": "Occurs if the sending account is linked to more than 1000 objects in the ledger. The transaction could succeed on retry if some of those objects were deleted separately first."
        }
    }
}
